app/controllers/products_controller.rb

	def index
		@products = if params[:search]
			Product.where("LOWER(name) LIKE LOWER(?)", "%#{params[:search]}%").order('products.created_at DESC').page(params[:page])
		else
	 		Product.order('products.created_at DESC').page(params[:page])
---
SELECT  "products".* FROM "products" WHERE (LOWER(name) LIKE LOWER('%gloves%'))  ORDER BY products.created_at DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "products" WHERE (LOWER(name) LIKE LOWER('%gloves%'))
SELECT  "products".* FROM "products"  ORDER BY products.created_at DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "products"

	def create
		@product = Product.new(product_params)

		if @product.save
---
INSERT INTO "products" ("name", "description", "price_in_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "proper gloves"], ["description", "damn these are proper"], ["price_in_cents", 100000], ["created_at", "2015-02-25 21:14:20.246317"], ["updated_at", "2015-02-25 21:14:20.246317"]]

  def update
    @product = Product.find(params[:id])

    if @product.update_attributes(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 201]]
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "Damn these are proper"], ["updated_at", "2015-02-25 21:18:57.233679"], ["id", 201]]