app/controllers/reviews_controller.rb

  def create
  	@review = @product.reviews.build(review_params)
  	@review.user = current_user
    load_product
    if @review.save
---
INSERT INTO "reviews" ("comment", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "fuck you"], ["product_id", 1], ["user_id", 1], ["created_at", "2015-02-24 22:43:41.998486"], ["updated_at", "2015-02-24 22:43:41.998486"]]

  def update
    @review = Review.find(params[:id])

    if @review.update_attributes(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "Fuck you!!!"], ["updated_at", "2015-02-24 23:13:33.311113"], ["id", 1]]

  def load_product
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]