app/views/products/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
---

  <% @product.reviews.each do |review| %>